In [1]:
import pandas as pd

In [2]:
stocks = pd.read_csv('http://bit.ly/smallstocks')

In [6]:
stocks

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [11]:
stocks.groupby('Symbol')['Close'].mean()

Symbol
AAPL    112.856667
CSCO     31.480000
MSFT     57.433333
Name: Close, dtype: float64

In [14]:
ser = stocks.groupby(['Symbol', 'Date'])['Close'].mean()
ser

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

In [19]:
ser.loc['AAPL']

Date
2016-10-03    112.52
2016-10-04    113.00
2016-10-05    113.05
Name: Close, dtype: float64

In [17]:
ser.loc['AAPL', '2016-10-04']

113.0

In [18]:
ser.loc[:, '2016-10-04']

Symbol
AAPL    113.00
CSCO     31.35
MSFT     57.24
Name: Close, dtype: float64

In [20]:
stocks

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [21]:
stocks.set_index(['Symbol', 'Date'], inplace=True)

In [22]:
stocks

                    Close    Volume
Symbol Date
CSCO   2016-10-03   31.50  14070500
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500
AAPL   2016-10-04  113.00  29736800
MSFT   2016-10-04   57.24  20085900
CSCO   2016-10-04   31.35  18460400
MSFT   2016-10-05   57.64  16726400
CSCO   2016-10-05   31.59  11808600
AAPL   2016-10-05  113.05  21453100

In [23]:
stocks.sort_index(inplace=True)
stocks

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

In [25]:
stocks.loc['AAPL']

             Close    Volume
Date
2016-10-03  112.52  21701800
2016-10-04  113.00  29736800
2016-10-05  113.05  21453100

In [30]:
stocks.loc[('AAPL', '2016-10-04'), :]

Close          113.0
Volume    29736800.0
Name: (AAPL, 2016-10-04), dtype: float64

In [32]:
stocks.loc[(['AAPL', 'MSFT'], '2016-10-04'), :]

                    Close    Volume
Symbol Date
AAPL   2016-10-04  113.00  29736800
MSFT   2016-10-04   57.24  20085900

In [34]:
stocks.loc[('AAPL', ['2016-10-04', '2016-10-05']), :]

                    Close    Volume
Symbol Date
AAPL   2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100

In [35]:
stocks.loc[(slice(None), ['2016-10-04', '2016-10-05']), :]

                    Close    Volume
Symbol Date
AAPL   2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400